<?php

namespace Balon;

    class Date {


        public static function getDate($mon) {
            $month = array(
                1 => 'Січня', 2 => 'Лютого', 3 => 'Березня', 4 => 'Квітня',
                5 => 'Травня', 6 => 'Червня', 7 => 'Липня', 8 => 'Серпня',
                9 => 'Вересня', 10 => 'Жовтня', 11 => 'Листопада', 12 => 'Грудня',
                "01" => 'Січня', "02" => 'Лютого', "03" => 'Березня', "04" => 'Квітня',
                "05" => 'Травня', "06" => 'Червня', "07" => 'Липня', "08" => 'Серпня',
                "09" => 'Вересня'
            );
            if ($month) {
                return $month[$mon];
            }
            else {
                return (date('d ') . $month[(date('n'))] . date(', H:i'));
            }
        }


    }

?>